test_cases/2d/aero_5h_2d/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    buildingCells; type cellSet; action new;
        source  boxToCell; box (14.4039 9.4373 0)(14.9301 9.8338 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.8127 5.0006 0)(8.173 5.5662 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9176 5.063 0)(10.5638 5.5366 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.154 8.4808 0)(6.7528 9.0651 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.1355 6.7899 0)(4.651 7.376 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.6209 2.6809 0)(10.1854 3.1535 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.5027 5.0157 0)(19.302 5.4891 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.2189 7.9674 0)(16.5323 8.4956 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.1112 3.4027 0)(18.8574 3.8419 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.4383 9.9596 0)(18.1015 10.3516 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.3397 1.6816 0)(14.6885 2.1368 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.053 1.9331 0)(19.5058 2.3297 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.4528 3.0711 0)(11.0915 3.61 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9564 10.1896 0)(10.6681 10.6725 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1994 1.2567 0)(17.8317 1.7815 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.6699 7.9779 0)(5.3514 8.4952 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.1744 10.1087 0)(9.7777 10.4567 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.8529 8.2841 0)(18.2037 8.7845 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.4078 10.2715 0)(20.1595 10.5759 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7671 3.2611 0)(5.5072 3.7085 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.4622 7.9339 0)(19.7691 8.5312 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.6334 4.948 0)(10.9748 5.3374 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.8314 6.0868 0)(4.3948 6.6434 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.7942 1.8004 0)(16.21 2.3802 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1566 7.2755 0)(15.4878 7.6248 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.7657 4.5227 0)(9.5202 5.0055 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.9529 7.8357 0)(13.6378 8.177 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.6373 8.5165 0)(15.1537 8.9125 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.0606 3.5861 0)(17.6876 3.9429 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.7551 8.9047 0)(11.1142 9.4354 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.105 5.2682 0)(5.5699 5.6262 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0148 9.7977 0)(8.4911 10.1522 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.0248 8.5829 0)(19.4193 9.0668 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.1348 9.9727 0)(4.7985 10.5491 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.8375 7.0184 0)(9.5363 7.4053 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.785 8.1327 0)(11.1448 8.638 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.9814 10.4971 0)(14.6808 10.9038 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0685 5.8965 0)(8.7845 6.4628 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.1977 1.2909 0)(7.9722 1.6758 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2778 4.1704 0)(4.7648 4.6936 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.3157 4.1852 0)(7.6684 4.6018 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.0694 5.4176 0)(20.6187 5.9017 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.7156 6.616 0)(10.2493 7.0452 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.8193 7.9068 0)(7.2435 8.4208 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.8768 2.3553 0)(7.4435 2.9411 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.1819 3.5166 0)(16.8849 3.9439 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.8159 9.4666 0)(9.1246 9.803 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.8805 7.9297 0)(6.5175 8.2947 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.5282 6.1916 0)(19.0449 6.7909 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.5808 3.5665 0)(15.1069 4.051 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.9159 9.5968 0)(12.4305 10.1529 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1918 6.7277 0)(15.826 7.2022 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.1786 2.2804 0)(14.4869 2.7779 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.9915 10.3359 0)(7.6307 10.8771 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.2009 2.4412 0)(12.6069 2.7514 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.0148 5.0804 0)(14.5679 5.5952 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.6397 4.2247 0)(10.2414 4.607 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.296 4.1427 0)(10.8308 4.7335 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.464 4.9995 0)(13.0851 5.3556 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.9145 7.2478 0)(18.6844 7.6171 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.7695 4.4652 0)(20.2544 4.7689 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1336 5.4743 0)(15.7626 5.8916 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2379 2.0758 0)(11.9076 2.6578 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1939 1.8653 0)(17.6166 2.2232 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.4349 2.9206 0)(9.1404 3.4503 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.6644 6.3468 0)(20.1863 6.89 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.7514 5.5381 0)(4.2101 5.8986 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.2132 1.8098 0)(18.952 2.1375 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5426 4.3825 0)(11.9119 4.7732 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.6189 7.6772 0)(19.315 8.2114 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.6903 2.7742 0)(18.0858 3.0902 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.3255 2.572 0)(16.6266 2.9147 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1442 7.2831 0)(17.6684 7.7825 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9045 7.8533 0)(10.5299 8.3993 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.1318 1.8546 0)(10.6287 2.1708 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.3768 5.2287 0)(19.8114 5.7616 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.7302 6.0896 0)(18.3542 6.4056 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.5506 10.5307 0)(6.3502 10.9636 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8525 9.747 0)(14.4029 10.2081 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.7299 9.7709 0)(19.3318 10.31 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.4508 9.7092 0)(10.0871 10.0817 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2453 2.5203 0)(4.8348 3.0187 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2585 10.3543 0)(11.627 10.8274 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.1986 9.5497 0)(20.5029 9.904 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.8314 7.6598 0)(4.6148 8.0566 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.5872 6.9297 0)(13.0663 7.4984 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.8482 10.2459 0)(16.234 10.7729 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.8861 10.3851 0)(15.4859 10.7426 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.0564 7.1298 0)(16.6289 7.6253 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.8065 2.7214 0)(13.3825 3.2205 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.614 7.9388 0)(12.1775 8.5045 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.0698 5.3136 0)(11.7149 5.6819 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.2872 8.6342 0)(15.7576 9.0765 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.9186 4.8333 0)(6.3296 5.2172 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.6672 9.0746 0)(17.4391 9.5597 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.1071 6.0233 0)(14.6686 6.5249 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.357 7.2211 0)(14.807 7.5749 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.0851 5.9331 0)(6.6716 6.3524 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8942 7.7039 0)(14.209 8.2807 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.7283 4.3648 0)(17.4432 4.6721 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8911 8.3455 0)(14.6278 8.8336 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.515 6.4741 0)(6.9785 6.7938 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.7401 8.1113 0)(9.1942 8.6281 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.2965 4.0947 0)(15.7389 4.5832 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.7177 2.1398 0)(8.0231 2.5921 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.3233 7.9223 0)(15.6933 8.5112 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.7219 1.2768 0)(13.0466 1.6102 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.721 1.5484 0)(12.3355 1.9507 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.5074 6.9214 0)(14.1008 7.3503 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7811 6.2324 0)(5.2059 6.6982 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.7028 5.8723 0)(12.3586 6.1735 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.854 7.6319 0)(8.6254 8.2139 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.2508 8.8491 0)(18.8892 9.266 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.8238 2.5607 0)(17.6071 3.153 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.4074 1.5116 0)(4.9542 2.0095 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.286 6.969 0)(8.0601 7.4481 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.9292 1.8073 0)(7.3302 2.3024 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2404 3.6534 0)(11.7964 4.0284 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.2849 4.8261 0)(20.695 5.2104 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.4981 4.6693 0)(12.988 4.9837 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.6311 2.9759 0)(8.1413 3.2972 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.1771 4.1105 0)(5.8806 4.6779 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.2819 4.396 0)(19.6961 4.9816 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.9287 6.9593 0)(5.4987 7.3841 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.8496 3.997 0)(9.6288 4.5013 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.8301 9.9226 0)(15.5406 10.2876 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.9649 5.2489 0)(7.6469 5.7945 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.9376 9.7364 0)(6.4858 10.1898 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.7104 6.4227 0)(12.3145 6.8346 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.4609 9.0798 0)(13.9212 9.6217 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.0774 9.6289 0)(5.3956 10.0978 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.6282 5.7106 0)(19.0648 6.0411 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.3082 1.9473 0)(20.8332 2.3399 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.2315 5.8278 0)(10.9327 6.3425 0.4);
    }
    {
        name    fluid; type cellSet; action new;
        source  cellToCell; set buildingCells;
    }
    {
        name    fluid; type cellSet; action invert;
    }
);

// ************************************************************************* //
